# DuctRoughness Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..DuctRoughness Property
ParameterTypeId Class See Also
---
"Roughness"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId DuctRoughness { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DuctRoughness As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ DuctRoughness {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace